---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeSettings.IsAnalysisForClosedLoopHydronicPipingNetworksEnabled(Autodesk.Revit.DB.Document)
source: html/13190276-346c-eeac-fcba-3c749092cf7f.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.IsAnalysisForClosedLoopHydronicPipingNetworksEnabled Method

Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document.

## Syntax (C#)
```csharp
public static bool IsAnalysisForClosedLoopHydronicPipingNetworksEnabled(
	Document ccda
)
```

## Parameters
- **ccda** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
Returns true if analysis for closed loop hydronic piping networks is enabled, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null